ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/ICSSM_XBAR_INTR_ICSSM_XBAR_INTR_52E03000h.xml
<module name="ICSSM_XBAR_INTR" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="ICSSM_XBAR_INTR_PID" acronym="ICSSM_XBAR_INTR_PID" offset="0" width="32" description="Identification register.">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Scheme" range="31:30" rwaccess="R"/>
	<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="bu" range="29:28" rwaccess="R"/>
	<bitfield id="FUNCTION" width="12" begin="27" end="16" resetval="0x1684" description="function" range="27:16" rwaccess="R"/>
	<bitfield id="RTLVER" width="5" begin="15" end="11" resetval="0x16" description="Rtl version" range="15:11" rwaccess="R"/>
	<bitfield id="MAJREV" width="3" begin="10" end="8" resetval="0x1" description="major version" range="10:8" rwaccess="R"/>
	<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="custom id" range="7:6" rwaccess="R"/>
	<bitfield id="MINREV" width="6" begin="5" end="0" resetval="0x0" description="minor version" range="5:0" rwaccess="R"/>
	</register><register id="ICSSM_XBAR_INTR_MUXCNTL_j" acronym="ICSSM_XBAR_INTR_MUXCNTL_j" offset="4" width="32" description="Interrupt mux control register.">
		<bitfield id="INT_ENABLE" width="1" begin="16" end="16" resetval="0x0" description="Interrupt j Output Enable." range="16" rwaccess="R/W"/>
	<bitfield id="MUX_CNTL" width="6" begin="5" end="0" resetval="0x0" description="Mux Control for Interrupt j." range="5:0" rwaccess="R/W"/>
	</register>
</module>